Revit 2027 API
ExternalDefinition.GetGroupTypeId Method
 Returns the identifier of the parameter definition's parameter group.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public override ForgeTypeId GetGroupTypeId()
Public Overrides Function GetGroupTypeId As ForgeTypeId
public:
virtual ForgeTypeId^ GetGroupTypeId() override
abstract GetGroupTypeId : unit -> ForgeTypeId
override GetGroupTypeId : unit -> ForgeTypeId
Return Value
ForgeTypeId
See Also
Reference
ExternalDefinition Class
Autodesk.Revit.DB Namespace